app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "priority", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "task 1"], ["priority", 1], ["completed", 0], ["created_at", "2022-07-21 17:14:33.221870"], ["updated_at", "2022-07-21 17:14:33.221870"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "title" = ?, "priority" = ?, "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "12312334xxsx23"], ["priority", 2], ["completed", 1], ["updated_at", "2022-07-21 18:24:46.446170"], ["id", 4]]
---
  def update
    if @task.update(task_params)